erp3l/src/AccountingRegisters/МСФО/МСФО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>МСФО</name>
  <chartOfAccounts>ChartOfAccounts.МСФО</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
    <accountingFlag>ChartOfAccounts.МСФО.AccountingFlag.Валютный</accountingFlag>
  </dimensions>
  <dimensions>
    <name>ВидОперации</name>
    <type>
      <types>CatalogRef.ВидыОпераций</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <accountingFlag>ChartOfAccounts.МСФО.AccountingFlag.УчетПоПодразделениям</accountingFlag>
  </dimensions>
  <dimensions>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
    <accountingFlag>ChartOfAccounts.МСФО.AccountingFlag.УчетПоНаправлениямДеятельности</accountingFlag>
  </dimensions>
  <resources>
    <name>СуммаВВалютеУчета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
  </resources>
  <resources>
    <name>СуммаВВалютеОтчетности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
  </resources>
  <resources>
    <name>СуммаВВалюте</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.МСФО.AccountingFlag.Валютный</accountingFlag>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.МСФО.AccountingFlag.Количественный</accountingFlag>
  </resources>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетДтИсточник</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетКтИсточник</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторФинЗаписи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоДт</name>
    <type>
      <types>CatalogRef.ИсточникиДанныхДляРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоКт</name>
    <type>
      <types>CatalogRef.ИсточникиДанныхДляРасчетов</types>
    </type>
  </attributes>
</mdclass:AccountingRegister>

erp3l/src/Documents/ОперацияМСФО/ОперацияМСФО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОперацияМСФО</name>
  <posting>Deny</posting>
  <registerRecords>InformationRegister.ГрафикиФИ</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСКонтрагентамиГрафики</registerRecords>
  <registerRecords>InformationRegister.РасчетныеДанныеРегламента</registerRecords>
  <registerRecords>InformationRegister.ПараметрыАмортизацииВНАМСФО</registerRecords>
  <registerRecords>InformationRegister.ПервоначальныеСведенияВНАМСФО</registerRecords>
  <registerRecords>AccumulationRegister.ДвижениеИнвестиций</registerRecords>
  <registerRecords>AccumulationRegister.РасчетныеДанныеЗапасы</registerRecords>
  <registerRecords>AccumulationRegister.РасчетныеДанныеВНА</registerRecords>
  <registerRecords>AccumulationRegister.СтоимостьВНАМСФО</registerRecords>
  <registerRecords>InformationRegister.АрендованныеВНА</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСКонтрагентамиПоДокументам</registerRecords>
  <registerRecords>AccumulationRegister.РасчетныеДанныеДЗ</registerRecords>
  <registerRecords>AccumulationRegister.РасчетныеДанныеФИ</registerRecords>
  <registerRecords>AccountingRegister.МСФО</registerRecords>
  <registerRecords>AccumulationRegister.ВыработкаВНА</registerRecords>
  <registerRecords>AccumulationRegister.БрокерскиеСчета</registerRecords>
  <registerRecords>InformationRegister.СведенияОФИ</registerRecords>
  <registerRecords>AccumulationRegister.РезервыПоПретензиям</registerRecords>
  <registerRecords>InformationRegister.РасшифровкиГрафиковЦБ</registerRecords>
  <registerRecords>InformationRegister.СтруктураСтоимостиЗапасовМСФО</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСКонтрагентамиФакт</registerRecords>
  <registerRecords>InformationRegister.РасчетныеДанныеОН</registerRecords>
  <registerRecords>AccumulationRegister.ПартииЦенныхБумаг</registerRecords>
  <registerRecords>InformationRegister.ДатыПоследовательностейУчастия</registerRecords>
  <registerRecords>InformationRegister.ПараметрыУчетаВНАМСФО</registerRecords>
  <registerRecords>InformationRegister.ОперацииПериодаФИ</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаОперации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособЗаполнения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СторнируемыйДокумент</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьТиповаяОперация</name>
    <type>
      <types>String</types>
      <types>DocumentRef</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </attributes>
  <attributes>
    <name>НезависимаяСуммаВО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗапрашиваемыеПараметры</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТаблицаРегистровСведений</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТаблицаРегистровНакопления</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗаполнениеДвижений</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

erp3l/src/Documents/РасчетОтложенныхНалогов/РасчетОтложенныхНалогов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасчетОтложенныхНалогов</name>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccountingRegister.МСФО</registerRecords>
  <registerRecords>InformationRegister.РасчетныеДанныеОН</registerRecords>
  <attributes>
    <name>ПериодОтчета</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РасчетОтложенныхНалогов</name>
    <attributes>
      <name>ВидОтложенногоНалога</name>
      <type>
        <types>CatalogRef.ВидыВременныхРазниц</types>
      </type>
    </attributes>
    <attributes>
      <name>ОстатокНСБУ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОстатокМСФО</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Разница</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаОНО</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаОНА</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПНО</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПНА</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

erp3l/src/CommonModules/ДатыЗапретаИзмененияУХ/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(ИсточникиДанных) Экспорт
	ДатыЗапретаИзмененияДобавитьСтроку(ИсточникиДанных, "Документ.ВводВНАВЭксплуатациюМСФО", "Дата" , "УчетПоМСФО", "Организация");
	ДатыЗапретаИзмененияДобавитьСтроку(ИсточникиДанных, "Документ.ВводНачальныхОстатковВНАМСФО", "Дата" , "УчетПоМСФО", "Организация");
	ДатыЗапретаИзмененияДобавитьСтроку(ИсточникиДанных, "Документ.ВводСведенийВНАМСФО", "Дата" , "УчетПоМСФО", "Организация");
	ДатыЗапретаИзмененияДобавитьСтроку(ИсточникиДанных, "Документ.ВводСведенийОФинансовыхИнструментах", "Дата" , "УчетПоМСФО", "Организация");
	ДатыЗапретаИзмененияДобавитьСтроку(ИсточникиДанных, "Документ.ВводСобытийВНАМСФО", "Дата" , "УчетПоМСФО", "Организация");
	ДатыЗапретаИзмененияДобавитьСтроку(ИсточникиДанных, "Документ.ВосстановлениеВНАИзРасходов", "Дата" , "УчетПоМСФО", "Организация");
	ДатыЗапретаИзмененияДобавитьСтроку(ИсточникиДанных, "Документ.ВыбытиеВНАМСФО", "Дата" , "УчетПоМСФО", "Организация");
	ДатыЗапретаИзмененияДобавитьСтроку(ИсточникиДанных, "Документ.ВыбытиеИнвестиций", "Дата" , "УчетПоМСФО", "Организация");
	ДатыЗапретаИзмененияДобавитьСтроку(ИсточникиДанных, "Документ.ВыработкаВНА", "Дата" , "УчетПоМСФО", "Организация");
	ДатыЗапретаИзмененияДобавитьСтроку(ИсточникиДанных, "Документ.ИзменениеПараметровВНАМСФО", "Дата" , "УчетПоМСФО", "Организация");
	ДатыЗапретаИзмененияДобавитьСтроку(ИсточникиДанных, "Документ.КонсолидационныеПоправки", "Дата" , "УчетПоМСФО", "Организация");
	ДатыЗапретаИзмененияДобавитьСтроку(ИсточникиДанных, "Документ.МодернизацияВНАМСФО", "Дата" , "УчетПоМСФО", "Организация");
	ДатыЗапретаИзмененияДобавитьСтроку(ИсточникиДанных, "Документ.НачислениеАмортизацииВНАМСФО", "Дата" , "УчетПоМСФО", "Организация");
	ДатыЗапретаИзмененияДобавитьСтроку(ИсточникиДанных, "Документ.НачислениеОперацийМСФО", "Дата" , "УчетПоМСФО", "Организация");
	ДатыЗапретаИзмененияДобавитьСтроку(ИсточникиДанных, "Документ.ОбесценениеВНАМСФО", "Дата" , "УчетПоМСФО", "Организация");
	ДатыЗапретаИзмененияДобавитьСтроку(ИсточникиДанных, "Документ.ОперацияМСФО", "Дата" , "УчетПоМСФО", "Организация");
	ДатыЗапретаИзмененияДобавитьСтроку(ИсточникиДанных, "Документ.ПереоценкаВалютныхАктивовОбязательств", "Дата" , "УчетПоМСФО", "Организация");
	ДатыЗапретаИзмененияДобавитьСтроку(ИсточникиДанных, "Документ.ПереоценкаВНАМСФО", "Дата" , "УчетПоМСФО", "Организация");
	ДатыЗапретаИзмененияДобавитьСтроку(ИсточникиДанных, "Документ.ПереоценкаФинансовыхИнструментов", "Дата" , "УчетПоМСФО", "Организация");
	ДатыЗапретаИзмененияДобавитьСтроку(ИсточникиДанных, "Документ.ПовторениеКорректировокПрошлыхПериодов", "Дата" , "УчетПоМСФО", "Организация");
	ДатыЗапретаИзмененияДобавитьСтроку(ИсточникиДанных, "Документ.ПоступлениеВНАМСФО", "Дата" , "УчетПоМСФО", "Организация");
	ДатыЗапретаИзмененияДобавитьСтроку(ИсточникиДанных, "Документ.ПоступлениеИнвестиций", "Дата" , "УчетПоМСФО", "Организация");
	ДатыЗапретаИзмененияДобавитьСтроку(ИсточникиДанных, "Документ.ПризнаниеРасходовПоАмортизацииНСБУ", "Дата" , "УчетПоМСФО", "Организация");
	ДатыЗапретаИзмененияДобавитьСтроку(ИсточникиДанных, "Документ.ПризнаниеРасходовФинансовыхИнструментов", "Дата" , "УчетПоМСФО", "Организация");
	ДатыЗапретаИзмененияДобавитьСтроку(ИсточникиДанных, "Документ.РасчетОтложенныхНалогов", "Дата" , "УчетПоМСФО", "Организация");
	ДатыЗапретаИзмененияДобавитьСтроку(ИсточникиДанных, "Документ.РасчетСебестоимости", "Дата" , "УчетПоМСФО", "Организация");
	ДатыЗапретаИзмененияДобавитьСтроку(ИсточникиДанных, "Документ.РасчетФинансовогоРезультата", "Дата" , "УчетПоМСФО", "Организация");
	ДатыЗапретаИзмененияДобавитьСтроку(ИсточникиДанных, "Документ.РегламентнаяОперацияПериодаВНАМСФО", "Дата" , "УчетПоМСФО", "Организация");
	ДатыЗапретаИзмененияДобавитьСтроку(ИсточникиДанных, "Документ.РегламентнаяОперацияПериодаПоФинансовымИнструментамМСФО", "Дата" , "УчетПоМСФО", "Организация");
	ДатыЗапретаИзмененияДобавитьСтроку(ИсточникиДанных, "Документ.РезервыПоДЗИАвансамВыданным", "Дата" , "УчетПоМСФО", "Организация");
	ДатыЗапретаИзмененияДобавитьСтроку(ИсточникиДанных, "Документ.РезервыПоЗапасам", "Дата" , "УчетПоМСФО", "Организация");
	ДатыЗапретаИзмененияДобавитьСтроку(ИсточникиДанных, "Документ.РезервыПоПретензиям", "Дата" , "УчетПоМСФО", "Организация");
	ДатыЗапретаИзмененияДобавитьСтроку(ИсточникиДанных, "Документ.РеклассОтложенныхНалогов", "Дата" , "УчетПоМСФО", "Организация");
	ДатыЗапретаИзмененияДобавитьСтроку(ИсточникиДанных, "Документ.РеформацияБаланса", "Дата" , "УчетПоМСФО", "Организация");
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрБухгалтерии.МСФО", "Период", "УчетПоМСФО", "Организация");
	
КонецПроцедуры

// Заполняет разделы дат запрета изменения, используемые при настройке дат запрета.
// Если не указать ни одного раздела, тогда будет доступна только настройка общей даты запрета.
//
// Параметры:
//  Разделы - ТаблицаЗначений - с колонками:
//   * Имя - Строка - имя используемое в описании источников данных в
//       процедуре ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения.
//
//   * Идентификатор - УникальныйИдентификатор - идентификатор ссылки элемента плана видов характеристик.
//       Чтобы получить идентификатор нужно в режиме 1С:Предприятия выполнить метод платформы:
//       "ПланыВидовХарактеристик.РазделыДатЗапретаИзменения.ПолучитьСсылку().УникальныйИдентификатор()".
//       Не следует указывать идентификаторы, полученные любым другим способом,
//       так как это может нарушить их уникальность.
//
//   * Представление - Строка - представляет раздел в форме настройки дат запрета.
//
//   * ТипыОбъектов  - Массив - типы ссылок объектов в разрезе которых можно настроить даты запрета,
//       например, Тип("СправочникСсылка.Организации"), если не указано ни одного типа,
//       то даты запрета будут настраиваться только с точностью до раздела.
//
Процедура ПриЗаполненииРазделовДатЗапретаИзменения(Разделы) Экспорт
	
	Раздел = Разделы.Добавить();
	Раздел.Имя  = "УчетПоМСФО";
	Раздел.Идентификатор = Новый УникальныйИдентификатор("8a725811-e24d-4522-8995-070a4c2d0784");
	Раздел.Представление = НСтр("ru = 'Учет по МСФО'");
	Раздел.ТипыОбъектов.Добавить(Тип("СправочникСсылка.Организации"));
	//Раздел.ТипыОбъектов.Добавить(Тип("СправочникСсылка.Проекты"));

	
КонецПроцедуры

// Обработчик подписки на событие ПередЗаписью для проверки запрета изменения.
//
// Параметры:
//  Источник        - ДокументОбъект - объект данных, передаваемый в подписку на событие ПередЗаписью.
//  Отказ           - Булево - параметр, передаваемый в подписку на событие ПередЗаписью.
//  РежимЗаписи     - Булево - параметр, передаваемый в подписку на событие ПередЗаписью.
//  РежимПроведения - Булево - параметр, передаваемый в подписку на событие ПередЗаписью.
//
Процедура ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(Источник, Отказ, РежимЗаписи, РежимПроведения);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДатыЗапретаИзмененияДобавитьСтроку(Данные, Таблица, ПолеДаты, Раздел, ПолеОбъекта)
	Найден = Ложь;
	Если СтрНачинаетсяС(ВРег(Таблица), ВРег("Документ")) Тогда
		Найден = Метаданные.Документы.Найти(Сред(Таблица, СтрНайти(Таблица, ".") + 1)) <> Неопределено;
	КонецЕсли;
	Если Найден Тогда
		ДатыЗапретаИзменения.ДобавитьСтроку(Данные, Таблица, ПолеДаты, Раздел, ПолеОбъекта);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
